test_cases/2d_water/0.6mmHotWaterNozzle_kEps_2D/system/extrudeMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      extrudeMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

constructFrom   patch;
sourceCase      ".";

sourcePatches   (wedge_back);
exposedPatchName wedge_front;

// REQUIRED IN v2412+
flipNormals     true;
mergeFaces      false;

extrudeModel    wedge;

nLayers         1;
expansionRatio  1.0;

sectorCoeffs
{
    axisPt      (0 0 0);
    axis        (1 0 0);  
    angle       5;        
}
// ************************************************************************* //
